"""Задача. Задача на программирование
Напишите программу, которая считывает переменные a, b, c и вычисляет формулу: """

import math


num1, num2, num3 = float(input()), float(input()), float(input())

up_equations = (num1**3) + (math.sqrt(num2))

print(up_equations / num3)
